In [ ]:
# Installing Pandas
pip install pandas

In [ ]:
#Data Structure in Pandas
#Series
#DataFrame

In [1]:
# Creation of Series
import pandas as pd #import Pandas with alias pd
series1 = pd.Series([10,20,30]) #create a Series
print(series1) #Display the series

0    10
1    20
2    30
dtype: int64

In [3]:
#Example has a numeric index in random order.
series2 = pd.Series(["Kavi","Shyam","Ravi"], index=[3,5,1])
print(series2)

3     Kavi
5    Shyam
1     Ravi
dtype: object

In [5]:
# Creation of Series from NumPy Arrays
#Series from a one-dimensional (1D) NumPy array:
import numpy as np # import NumPy with alias np
import pandas as pd
array1 = np.array([1,2,3,4])
series3 = pd.Series(array1)
print(series3)

0    1
1    2
2    3
3    4
dtype: int32

In [7]:
# we can use letters or strings as indices:
series4 = pd.Series(array1, index = ["Jan","Feb", "Mar", "Apr"])
print(series4)

Jan    1
Feb    2
Mar    3
Apr    4
dtype: int32

In [9]:
#Creation of Series from Dictionary
dict1 = {'India': 'NewDelhi', 'UK':
'London', 'Japan': 'Tokyo'}
print(dict1) #Display the dictionary
{'India': 'NewDelhi', 'UK': 'London', 'Japan':
'Tokyo'}

{'India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}

{'India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}

In [11]:
series8 = pd.Series(dict1)
print(series8)

India    NewDelhi
UK         London
Japan       Tokyo
dtype: object

In [13]:
# Accessing Elements of a Series
import pandas as pd
seriesNum = pd.Series([10,20,30])
seriesNum

0    10
1    20
2    30
dtype: int64

In [15]:
seriesMnths = pd.Series([2,3,4],index=["Feb","Mar","Apr"])
seriesMnths["Mar"]

3

In [17]:
#Slicing
seriesCapCntry = pd.Series(['NewDelhi', 'WashingtonDC', 'London','Paris'], index=['India', 'USA', 'UK', 'France'])
seriesCapCntry

India         NewDelhi
USA       WashingtonDC
UK              London
France           Paris
dtype: object

In [19]:

seriesCapCntry[1:3]

USA    WashingtonDC
UK           London
dtype: object

In [21]:
#Methods of Series
import numpy as np
seriesTenTwenty=pd.Series(np.arange(10,20, 1 ))
print(seriesTenTwenty)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [23]:
seriesTenTwenty.head(2)

0    10
1    11
dtype: int32

In [25]:
seriesTenTwenty.count()

10

In [27]:

seriesTenTwenty.tail(2)

8    18
9    19
dtype: int32

In [29]:
# Mathematical Operations on Series
seriesA = pd.Series([1,2,3,4,5], index =['a', 'b', 'c', 'd', 'e'])
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [31]:
seriesB = pd.Series([10,20,-10,-50,100],
index = ['z', 'y', 'a', 'c', 'e'])
seriesB

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [33]:
#that the output of addition is NaN if one of the elements or both elements have no value.
seriesA + seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [35]:
#Subtraction of two Series
seriesA - seriesB

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [37]:
#Multiplication of two Series
seriesA * seriesB

a    -10.0
b      NaN
c   -150.0
d      NaN
e    500.0
y      NaN
z      NaN
dtype: float64

In [39]:
# Division of two Series
seriesA/seriesB

a   -0.10
b     NaN
c   -0.06
d     NaN
e    0.05
y     NaN
z     NaN
dtype: float64

In [41]:
# Creation of DataFrame
# Creation of DataFrame from NumPy ndarrays
import numpy as np
array1 = np.array([10,20,30])
array2 = np.array([100,200,300])
array3 = np.array([-10,-20,-30, -40])
dFrame4 = pd.DataFrame(array1)
dFrame4

    0
0  10
1  20
2  30

In [43]:
#Creation of DataFrame from List of Dictionaries
listDict = [{'a':10, 'b':20}, {'a':5,'b':10, 'c':20}]
dFrameListDict = pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [45]:
#Creation of DataFrame from Series
seriesA = pd.Series([1,2,3,4,5],index = ['a', 'b', 'c', 'd', 'e'])
seriesB = pd.Series ([1000,2000,-1000,-5000,1000],index = ['a', 'b', 'c', 'd', 'e'])
seriesC = pd.Series([10,20,-10,-50,100],index = ['z', 'y', 'a', 'c', 'e'])

dFrame6 = pd.DataFrame(seriesA)
dFrame6

   0
a  1
b  2
c  3
d  4
e  5

In [47]:
dFrame7 = pd.DataFrame([seriesA, seriesB])
dFrame7

      a     b     c     d     e
0     1     2     3     4     5
1  1000  2000 -1000 -5000  1000

In [49]:
# Creation of DataFrame from Dictionary of Series
ResultSheet={'Arnab': pd.Series([90, 91, 97],index=['Maths','Science','Hindi']),
'Ramit': pd.Series([92, 81, 96],index=['Maths','Science','Hindi']),
'Sahir': pd.Series([89, 91, 88],index=['Maths','Science','Hindi']),
'Riya': pd.Series([81, 71, 67],index=['Maths','Science','Hindi']),
'Mallika': pd.Series([94, 95, 99],index=['Maths','Science','Hindi'])}
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Sahir  Riya  Mallika
Maths       90     92     89    81       94
Science     91     81     91    71       95
Hindi       97     96     88    67       99

In [51]:
#Operations on rows and columns in DataFrames
#Adding a New Column to a DataFrame
ResultDF['Jimmy']=[89,78,76]
ResultDF

         Arnab  Ramit  Sahir  Riya  Mallika  Jimmy
Maths       90     92     89    81       94     89
Science     91     81     91    71       95     78
Hindi       97     96     88    67       99     76

In [53]:
#Adding a New Row to a DataFrame
#DataFRame.loc[] method can also be used to change the data values of a row to a particular value.
ResultDF.loc['English'] = [85, 86, 83, 80, 90, 89,82]
ResultDF

ValueError: cannot set a row with mismatched columns

In [55]:

#Deleting Rows or Columns from a DataFrame
#delete the row with label 'Science'
ResultDF = ResultDF.drop('Science', axis=0)
ResultDF

       Arnab  Ramit  Sahir  Riya  Mallika  Jimmy
Maths     90     92     89    81       94     89
Hindi     97     96     88    67       99     76